# Reading the Tabular Data

In [1]:
import pandas as pd

In [2]:
Data=pd.read_table("CRO.csv")

In [3]:
Data.head()

  country,"age","new_user","source","total_pages_visited","converted"
0                                  UK,25,1,"Ads",1,0
1                                  US,23,1,"Seo",5,0
2                                  US,28,1,"Seo",4,0
3                               China,39,1,"Seo",5,0
4                                  US,30,1,"Seo",6,0

In [4]:
Data=pd.read_table("CRO.csv",sep=',')

In [5]:
Data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

# set the column names by user

In [7]:
Data=pd.read_table("CRO.csv",sep=',',header=None)

C:\Users\esreenat\AppData\Local\Continuum\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2717: DtypeWarning: Columns (1,2,4,5) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [8]:
Data.head()

         0    1         2       3                    4          5
0  country  age  new_user  source  total_pages_visited  converted
1       UK   25         1     Ads                    1          0
2       US   23         1     Seo                    5          0
3       US   28         1     Seo                    4          0
4    China   39         1     Seo                    5          0

In [10]:
user_columns=["first","second","third","fourth","five","six"]

In [11]:
Data=pd.read_table("CRO.csv",sep=',',header=None,names=user_columns)

C:\Users\esreenat\AppData\Local\Continuum\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2717: DtypeWarning: Columns (1,2,4,5) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [12]:
Data.head()

     first second     third  fourth                 five        six
0  country    age  new_user  source  total_pages_visited  converted
1       UK     25         1     Ads                    1          0
2       US     23         1     Seo                    5          0
3       US     28         1     Seo                    4          0
4    China     39         1     Seo                    5          0

# how to read the data from csv files

In [14]:
Data=pd.read_csv("CRO.csv")

In [16]:
Data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

# how do select series from dataframe

In [17]:
Data.columns

Index(['country', 'age', 'new_user', 'source', 'total_pages_visited',
       'converted'],
      dtype='object')

In [20]:
Data.head(2)#Default it will give First five columns

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0

In [30]:
age=Data.age

In [31]:
type(age)

pandas.core.series.Series

In [32]:
age1=Data["age"]

In [33]:
type(age1)

pandas.core.series.Series

In [34]:
age2=Data[["age"]]

In [35]:
type(age2)

pandas.core.frame.DataFrame

In [37]:
age2.head(2)

   age
0   25
1   23

In [38]:
age1.head()

0    25
1    23
2    28
3    39
4    30
Name: age, dtype: int64

In [39]:
age.head()

0    25
1    23
2    28
3    39
4    30
Name: age, dtype: int64

In [40]:
age.shape

(316200,)

In [41]:
age2.shape

(316200, 1)

In [42]:
Data.shape

(316200, 6)

# How do select particumlar columns in dataframe

In [45]:
Data.head(2)

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0

In [47]:
Df1=Data[["age","source"]]

In [48]:
Df1.head(2)

   age source
0   25    Ads
1   23    Seo

# How do create new series in dataframe

In [57]:
loc=Data["country"]+"-"+Data["source"]

In [58]:
type(loc)

pandas.core.series.Series

In [59]:
loc.head()

0       UK-Ads
1       US-Seo
2       US-Seo
3    China-Seo
4       US-Seo
dtype: object

In [60]:
Data["loc"]=Data["country"]+"-"+Data["source"]

In [61]:
Data.head(2)

  country  age  new_user source  total_pages_visited  converted     loc
0      UK   25         1    Ads                    1          0  UK-Ads
1      US   23         1    Seo                    5          0  US-Seo

# Basic operaations:

In [62]:
Data.head()

  country  age  new_user source  total_pages_visited  converted        loc
0      UK   25         1    Ads                    1          0     UK-Ads
1      US   23         1    Seo                    5          0     US-Seo
2      US   28         1    Seo                    4          0     US-Seo
3   China   39         1    Seo                    5          0  China-Seo
4      US   30         1    Seo                    6          0     US-Seo

In [64]:
Data.describe()#group b y operation on numerical columns

                 age       new_user  total_pages_visited      converted
count  316200.000000  316200.000000        316200.000000  316200.000000
mean       30.569858       0.685465             4.872966       0.032258
std         8.271802       0.464331             3.341104       0.176685
min        17.000000       0.000000             1.000000       0.000000
25%        24.000000       0.000000             2.000000       0.000000
50%        30.000000       1.000000             4.000000       0.000000
75%        36.000000       1.000000             7.000000       0.000000
max       123.000000       1.000000            29.000000       1.000000

In [67]:
Data.shape  # print the shape of the data

(316200, 7)

In [69]:
Data.dtypes  # print data types of each column

country                object
age                     int64
new_user                int64
source                 object
total_pages_visited     int64
converted               int64
loc                    object
dtype: object

In [70]:
k=Data.dtypes

In [71]:
type(k)

pandas.core.series.Series

In [80]:
j=list(Data.dtypes.index)

In [81]:
type(j)

list

In [82]:
j

['country',
 'age',
 'new_user',
 'source',
 'total_pages_visited',
 'converted',
 'loc']

In [85]:
columns=pd.DataFrame(j,columns=["name of column"])

In [86]:
columns

        name of column
0              country
1                  age
2             new_user
3               source
4  total_pages_visited
5            converted
6                  loc

In [92]:
m=Data.as_matrix()

In [93]:
type(m)

numpy.ndarray

In [94]:
m

array([['UK', 25, 1, ..., 1, 0, 'UK-Ads'],
       ['US', 23, 1, ..., 5, 0, 'US-Seo'],
       ['US', 28, 1, ..., 4, 0, 'US-Seo'],
       ...,
       ['China', 25, 0, ..., 4, 0, 'China-Ads'],
       ['US', 22, 0, ..., 4, 0, 'US-Seo'],
       ['UK', 24, 0, ..., 4, 0, 'UK-Ads']], dtype=object)

In [95]:
m.shape

(316200, 7)

In [96]:
Data.describe()

                 age       new_user  total_pages_visited      converted
count  316200.000000  316200.000000        316200.000000  316200.000000
mean       30.569858       0.685465             4.872966       0.032258
std         8.271802       0.464331             3.341104       0.176685
min        17.000000       0.000000             1.000000       0.000000
25%        24.000000       0.000000             2.000000       0.000000
50%        30.000000       1.000000             4.000000       0.000000
75%        36.000000       1.000000             7.000000       0.000000
max       123.000000       1.000000            29.000000       1.000000

In [97]:
Data.describe(include=['object'])

       country  source     loc
count   316200  316200  316200
unique       4       3      12
top         US     Seo  US-Seo
freq    178092  155040   87229

In [104]:
Data.describe(exclude=["int"])

,country,age,new_user,source,total_pages_visited,converted,loc
count,316200,316200.000000,316200.000000,316200,316200.000000,316200.000000,316200
unique,4,NaN,NaN,3,NaN,NaN,12
top,US,NaN,NaN,Seo,NaN,NaN,US-Seo
freq,178092,NaN,NaN,155040,NaN,NaN,87229
mean,NaN,30.569858,0.685465,NaN,4.872966,0.032258,NaN
std,NaN,8.271802,0.464331,NaN,3.341104,0.176685,NaN
min,NaN,17.000000,0.000000,NaN,1.000000,0.000000,NaN
25%,NaN,24.000000,0.000000,NaN,2.000000,0.000000,NaN
50%,NaN,30.000000,1.000000,NaN,4.000000,0.000000,NaN
75%,NaN,36.000000,1.000000,NaN,7.000000,0.000000,NaN
max,NaN,123.000000,1.000000,NaN,29.000000,1.000000,NaN

# Reaneming the columns in dataframe

In [105]:
Data.head()

  country  age  new_user source  total_pages_visited  converted        loc
0      UK   25         1    Ads                    1          0     UK-Ads
1      US   23         1    Seo                    5          0     US-Seo
2      US   28         1    Seo                    4          0     US-Seo
3   China   39         1    Seo                    5          0  China-Seo
4      US   30         1    Seo                    6          0     US-Seo

In [108]:
Data.rename(columns={"country":"nation","source":"resourse"},inplace=True)

In [109]:
Data.head()

  nation  age  new_user resourse  total_pages_visited  converted        loc
0     UK   25         1      Ads                    1          0     UK-Ads
1     US   23         1      Seo                    5          0     US-Seo
2     US   28         1      Seo                    4          0     US-Seo
3  China   39         1      Seo                    5          0  China-Seo
4     US   30         1      Seo                    6          0     US-Seo

In [116]:
user_columns=["first","second","third","fourth","five","six","seven"]

In [117]:
type(Data.columns)

pandas.indexes.base.Index

In [118]:
Data.columns=user_columns

In [119]:
Data.columns

Index(['first', 'second', 'third', 'fourth', 'five', 'six', 'seven'], dtype='object')

# How do remove columns from dataframe

In [121]:
Data.head()

   first  second  third fourth  five  six      seven
0     UK      25      1    Ads     1    0     UK-Ads
1     US      23      1    Seo     5    0     US-Seo
2     US      28      1    Seo     4    0     US-Seo
3  China      39      1    Seo     5    0  China-Seo
4     US      30      1    Seo     6    0     US-Seo

In [128]:
Data.drop("first",inplace=True,axis=1)  # remove one columns

In [129]:
Data.head()

   second  third fourth  five  six
0      25      1    Ads     1    0
1      23      1    Seo     5    0
2      28      1    Seo     4    0
3      39      1    Seo     5    0
4      30      1    Seo     6    0

In [130]:
Data.drop(["third","six"],inplace=True,axis=1) # remove multiple columns

In [131]:
Data.head()

   second fourth  five
0      25    Ads     1
1      23    Seo     5
2      28    Seo     4
3      39    Seo     5
4      30    Seo     6

In [134]:
Data.count()  # print no of samples

second    316200
fourth    316200
five      316200
dtype: int64

In [135]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 316200 entries, 0 to 316199
Data columns (total 3 columns):
second    316200 non-null int64
fourth    316200 non-null object
five      316200 non-null int64
dtypes: int64(2), object(1)
memory usage: 7.2+ MB

In [136]:
Data.head()

   second fourth  five
0      25    Ads     1
1      23    Seo     5
2      28    Seo     4
3      39    Seo     5
4      30    Seo     6

# How do delete multiple rows from dataframe

In [145]:
Data.drop([4,9],axis=0,inplace=True)

In [146]:
Data.head()

   second fourth  five
2      28    Seo     4
3      39    Seo     5
5      31    Seo     1
6      27    Seo     4
7      23    Ads     4

# Sorting dataframe

In [147]:
New_data=pd.read_csv("CRO.csv")

In [148]:
New_data.columns

Index(['country', 'age', 'new_user', 'source', 'total_pages_visited',
       'converted'],
      dtype='object')

In [150]:
New_data.sort_values("age").head()  # ascending order

       country  age  new_user  source  total_pages_visited  converted
229166      US   17         1     Seo                    4          0
97994       US   17         1     Ads                    5          0
118149      US   17         1     Seo                   14          1
90844       US   17         1  Direct                    1          0
39340       UK   17         1  Direct                    1          0

In [152]:
New_data.sort_values("age",ascending=False).head() #descending order

        country  age  new_user  source  total_pages_visited  converted
90928   Germany  123         0     Seo                   15          1
295581       UK  111         0     Ads                   10          1
265167       US   79         1  Direct                    1          0
192644       US   77         0  Direct                    4          0
154217       US   73         1     Seo                    5          0

In [153]:
New_data.country.order()

C:\Users\esreenat\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

217850    China
53181     China
228851    China
53179     China
53178     China
53177     China
53176     China
53175     China
53174     China
94275     China
94276     China
228858    China
53170     China
228859    China
161431    China
53167     China
228849    China
161424    China
161432    China
228844    China
94261     China
228808    China
228818    China
228819    China
94263     China
161449    China
161447    China
228827    China
94267     China
161443    China
          ...
188449       US
77749        US
188451       US
77748        US
188453       US
188434       US
77765        US
188433       US
188431       US
188412       US
77757        US
188414       US
77756        US
77755        US
77753        US
188418       US
188419       US
188420       US
188421       US
188422       US
188423       US
188424       US
188425       US
77752        US
188427       US
188428       US
188429       US
188430       US
188432       US
158099       US
Name: country, dtype: object

# filter rows by column value

In [154]:
New_data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

In [155]:
data=New_data

In [157]:
data[data.age>50].head()

    country  age  new_user  source  total_pages_visited  converted
408      US   56         0     Seo                   10          0
432      US   52         1     Seo                    2          0
449      US   56         0  Direct                    4          0
453      US   54         1     Seo                    2          0
474      US   51         0  Direct                    1          0

In [159]:
data[data.age>50].source.head()

408       Seo
432       Seo
449    Direct
453       Seo
474    Direct
Name: source, dtype: object

In [160]:
data.loc[data.age>50,"source"].head()

408       Seo
432       Seo
449    Direct
453       Seo
474    Direct
Name: source, dtype: object

In [163]:
data[data.age>50].head()

    country  age  new_user  source  total_pages_visited  converted
408      US   56         0     Seo                   10          0
432      US   52         1     Seo                    2          0
449      US   56         0  Direct                    4          0
453      US   54         1     Seo                    2          0
474      US   51         0  Direct                    1          0

In [167]:
data.loc[(data.age>50)& (data.source=="Seo"),"source"].head()

408    Seo
432    Seo
453    Seo
613    Seo
730    Seo
Name: source, dtype: object

# how do read only some columns from csv file

In [168]:
data=pd.read_csv("CRO.csv")

In [169]:
data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

In [170]:
data2=pd.read_csv("CRO.csv",usecols=["country","source"])

In [172]:
data2.columns

Index(['country', 'source'], dtype='object')

In [173]:
data2.head()

  country source
0      UK    Ads
1      US    Seo
2      US    Seo
3   China    Seo
4      US    Seo

In [174]:
data2=pd.read_csv("CRO.csv",usecols=[2,3])

In [175]:
data2.head()

   new_user source
0         1    Ads
1         1    Seo
2         1    Seo
3         1    Seo
4         1    Seo

In [176]:
data2=pd.read_csv("CRO.csv",nrows=3)

In [177]:
data2

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0

In [179]:
data=pd.read_csv("CRO.csv",nrows=3)

In [180]:
data

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0

In [181]:
for i in data.age:
    print(i)

25
23
28

In [182]:
for index,row in data.iterrows():
    print(index,row.age,row.new_user)

0 25 1
1 23 1
2 28 1

In [183]:
for index,row in data.iterrows():
    print(index,row)

0 country                 UK
age                     25
new_user                 1
source                 Ads
total_pages_visited      1
converted                0
Name: 0, dtype: object
1 country                 US
age                     23
new_user                 1
source                 Seo
total_pages_visited      5
converted                0
Name: 1, dtype: object
2 country                 US
age                     28
new_user                 1
source                 Seo
total_pages_visited      4
converted                0
Name: 2, dtype: object

In [184]:
data

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0

In [185]:
data.dtypes

country                object
age                     int64
new_user                int64
source                 object
total_pages_visited     int64
converted               int64
dtype: object

# How to drop every non numeric columnms

In [186]:
import numpy as np

In [188]:
data.select_dtypes(include=[np.number]).dtypes

age                    int64
new_user               int64
total_pages_visited    int64
converted              int64
dtype: object

In [195]:
data.select_dtypes(include=[np.object]).dtypes

country    object
source     object
dtype: object